vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA265_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_ecc" Cversion="1.0.0" condition="component.sgi_pkc.examples_ecc.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_ECDH_KeyAgreement_NIST_P256_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_ECDSA_FixedKeys_NIST_P256_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_ECDSA_GeneratedKeys_NIST_P256_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_ECDSA_VerifyOnly_NIST_P256_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519ctx_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519ph_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_GenerateSignature_Ed25519_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_VerifySignature_Ed25519_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_MontDH_Curve448_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_MontDH_Curve25519_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_WeierECC_CustomEccWeierType_BN256_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_WeierECC_DecodePoint_brainpoolP384r1_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_WeierECC_DecodePoint_secp224r1_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_WeierECC_KeyValidation_PrivateKey_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClEcc/mcuxClEcc_WeierECC_KeyValidation_PublicKey_example.c" projectpath="component/sgi_pkc/examples/mcuxClEcc"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_ffdh" Cversion="1.0.0" condition="component.sgi_pkc.examples_ffdh.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClFfdh/mcuxClFfdh_KeyAgreement_ffdhe2048_example.c" projectpath="component/sgi_pkc/examples/mcuxClFfdh"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClFfdh/mcuxClFfdh_KeyAgreement_ffdhe3072_example.c" projectpath="component/sgi_pkc/examples/mcuxClFfdh"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClFfdh/mcuxClFfdh_KeyAgreement_ffdhe4096_example.c" projectpath="component/sgi_pkc/examples/mcuxClFfdh"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClFfdh/mcuxClFfdh_KeyAgreement_ffdhe6144_example.c" projectpath="component/sgi_pkc/examples/mcuxClFfdh"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClFfdh/mcuxClFfdh_KeyAgreement_ffdhe8192_example.c" projectpath="component/sgi_pkc/examples/mcuxClFfdh"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_flow_protection" Cversion="1.0.0" condition="component.sgi_pkc.examples_flow_protection.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/mcuxCsslFlowProtection_Assert_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslFlowProtection"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/mcuxCsslFlowProtection_Branch_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslFlowProtection"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/mcuxCsslFlowProtection_Function_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslFlowProtection"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/mcuxCsslFlowProtection_Loop_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslFlowProtection"/>
        <file category="header" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/inc/mcuxCsslExamples.h" projectpath="component/sgi_pkc/examples/mcuxCsslFlowProtection/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_glikey" Cversion="1.0.0" condition="component.sgi_pkc.examples_glikey.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClGlikey/mcuxClGlikey_example.c" projectpath="component/sgi_pkc/examples/mcuxClGlikey"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
