vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA265_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_hash" Cversion="1.0.0" condition="component.sgi_pkc.hash.condition_id">
      <description>Component sgi_pkc.hash</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_common.c" projectpath="component/sgi_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_compute.c" projectpath="component/sgi_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_oneshot_compute.c" projectpath="component/sgi_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHash/src/mcuxClHash_Oid.c" projectpath="component/sgi_pkc/src/comps/mcuxClHash/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHash/inc/mcuxClHash.h" projectpath="component/sgi_pkc/src/comps/mcuxClHash/inc"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHash/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClHash/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClHash/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal_Memory.h" projectpath="component/sgi_pkc/src/comps/mcuxClHash/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClHash/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClHash/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_hashmodes" Cversion="1.0.0" condition="component.sgi_pkc.hashmodes.condition_id">
      <description>Component sgi_pkc.hashmodes</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_Resource_Common.c" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_sgi_sha2.c" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_sgi_sha2_common.c" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_sgi_sha2_dma_Common.c" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_sgi_sha2_dma_nonBlocking.c" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHashModes/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Algorithms.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_Memory.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_nonBlocking.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_Resource_Common.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_sgi_sha2.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_sgi_sha2_common.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_MemoryComputation.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_ModesConstants.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_ModesMemoryMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_ModesMemoryMacros_Impl.h" projectpath="component/sgi_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClHashModes/inc/internal/"/>
      </files>
    </component>
